BrianLChen/nRF52840-2.4GKeyboard/Application/main.c
/**
 * Copyright (c) 2017 - 2021, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include "nrf.h"
#include "nrf_delay.h"
#include "nrf_drv_clock.h"
#include "nrf_drv_power.h"
#include "nrf_drv_usbd.h"
#include "nrf_gpio.h"
#include "nrf_pwr_mgmt.h"

#include "nrf_gzll.h"
#include "nrf_gzll_error.h"

#include "app_error.h"
#include "app_timer.h"
#include "app_usbd.h"
#include "app_usbd_core.h"
#include "bsp.h"
#include "custom_usbd_hid_kbd.h"
#include "nrf_drv_spi.h"
#include "nrfx_gpiote.h"
#include "nrfx_spim.h"
#include "nrfx_timer.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "Key.h"
#include "Keyboard_Config.h"
#include "LED.h"
#include "ws2812.h"

/* Gazell Config */
#define PIPE_NUMBER 1                       /**< Pipe 0 is used in this example. */
#define TX_PAYLOAD_LENGTH keyboard_rep_byte /**< 1-byte payload length is used when transmitting. */
#define RX_RECEIVE_LENGTH 1
#define MAX_TX_ATTEMPTS 20 /**< Maximum number of transmission attempts */
#define Channel_Table_Size 5

/* Mode Detect Pin */
#define WIRE_MODE_PIN NRF_GPIO_PIN_MAP(1, 1)
#define WIRELESS_MODE_PIN NRF_GPIO_PIN_MAP(1, 2)
#define BLE_MODE_PIN NRF_GPIO_PIN_MAP(1, 3)

/* SPI Scan Pin */
#define PL_Pin NRF_GPIO_PIN_MAP(1, 11)

#define WAKE_UP_PIN NRF_GPIO_PIN_MAP(1, 7)
#define MOS_CTRL_PIN NRF_GPIO_PIN_MAP(1, 8)

/* WS2812 SPI Pin */
#define WS2812_MOSI_PIN NRF_GPIO_PIN_MAP(1, 15)
#define WS2812_SCK_PIN NRF_GPIO_PIN_MAP(1, 14)

/* Knob Pin */
#define KNOB_A_PIN NRF_GPIO_PIN_MAP(0, 11)
#define KNOB_B_PIN NRF_GPIO_PIN_MAP(0, 25)
// GAZELL
static uint8_t m_data_payload[TX_PAYLOAD_LENGTH]; /**< Payload to send to Host. */
static uint8_t m_ack_payload[RX_RECEIVE_LENGTH];  /**< Placeholder for received ACK payloads from Host. */
uint8_t Channel_Table[Channel_Table_Size] = {4, 25, 42, 63, 77};

// TIMER
const nrfx_timer_t TIMER_KBD = NRFX_TIMER_INSTANCE(1);
const nrfx_timer_t TIMER_SLEEP = NRFX_TIMER_INSTANCE(2);

// KEYBOARD BUFF
uint8_t KEYBOARD_Rep_Buff[keyboard_rep_byte] = {0};
uint8_t KEYBOARD_Rep_Buff_Prev[keyboard_rep_byte] = {0};
uint8_t CONSUMER_Rep_Buff[consumer_rep_byte] = {0};
uint8_t CONSUMER_Rep_Buff_Prev[consumer_rep_byte] = {0};
const uint8_t ZERO_buff[16] = {0};

// SPI
static const nrfx_spim_t scan_spi = NRFX_SPIM_INSTANCE(0);

static uint8_t m_tx_buff[1];
static uint8_t m_rx_buff[2];
static uint8_t scan_buff[KEY_NUMBER / 8];

static const nrfx_spim_xfer_desc_t scan_spi_desc = {m_tx_buff, 1, m_rx_buff, KEY_NUMBER / 8};

// WS2812 RGB SPI
static const nrfx_spim_t WS2812_SPI = NRFX_SPIM_INSTANCE(1);
static const ws2812_t RGB_LIGHT = {WS2812_SPI, WS2812_MOSI_PIN, WS2812_SCK_PIN};

// Other
uint32_t Sleep_Time_Out_Counter = 0; // counter for sleep time
uint8_t Mode;                        // Mode indicator
uint8_t KNOB_CW = 0;
uint8_t KNOB_CCW = 0;

// uint8_t KEY_TABLE[8] = {KEYBOARD_A, KEYBOARD_B, KEYBOARD_C, KEYBOARD_D,
//     KEYBOARD_E, MODIFIER_LEFT_UI, CONSUMER_VOLUME_DECREASE, CONSUMER_MUTE};
// uint8_t KEY_TABLE[8] = {KEYBOARD_A, KEYBOARD_B, KEYBOARD_C, KEYBOARD_D,
//    KEYBOARD_E, KEYBOARD_F, KEYBOARD_G, KEYBOARD_H};

/**
 * @brief Enable USB power detection
 */
#ifndef USBD_POWER_DETECTION
#define USBD_POWER_DETECTION true
#endif

/**
 * @brief USB composite interfaces
 */
#define APP_USBD_INTERFACE_KBD 0
/**
 * @brief User event handler, HID keyboard
 */
static void hid_kbd_user_ev_handler(app_usbd_class_inst_t const *p_inst,
    app_usbd_hid_user_event_t event);

/*lint -save -e26 -e64 -e123 -e505 -e651*/

/**
 * @brief Global HID keyboard instance
 */
APP_USBD_HID_KBD_GLOBAL_DEF(m_app_hid_kbd,
    APP_USBD_INTERFACE_KBD,
    NRF_DRV_USBD_EPIN1,
    hid_kbd_user_ev_handler,
    APP_USBD_HID_SUBCLASS_BOOT);
/*lint -restore*/

// Get keyboard LED indicator status
static void kbd_status(void)
{
    if (app_usbd_hid_kbd_led_state_get(&m_app_hid_kbd, APP_USBD_HID_KBD_LED_NUM_LOCK))
    {
        LED_On(LED1);
    }
    else
    {
        LED_Off(LED1);
    }

    if (app_usbd_hid_kbd_led_state_get(&m_app_hid_kbd, APP_USBD_HID_KBD_LED_CAPS_LOCK))
    {
        LED_On(LED0);
    }
    else
    {
        LED_Off(LED0);
    }
}

void Pin_Cfg(void)
{
    nrf_gpio_cfg_output(TX_PIN_NUMBER);
    nrf_gpio_cfg_output(RX_PIN_NUMBER);
    nrf_gpio_cfg_output(LED0);
    nrf_gpio_cfg_output(LED1);

