BrianLChen/nRF52840-2.4GKeyboard/Application/main.c
}


inline void remap()
{
    uint8_t bitIndex, index;
    // uint8_t remap_buff = ~scan_buff;
    uint8_t remap_buff[KEY_NUMBER / 8];
    memcpy(remap_buff, scan_buff, KEY_NUMBER / 8);
    for (uint8_t i = 0; i < KEY_NUMBER; i++)
    {
        index = i / 8;
        bitIndex = i % 8;
        // uint8_t temp = 0x01 << i;
        // uint8_t temp2 = temp & remap_buff;
        if (remap_buff[index] & (0x01 << bitIndex))
        {
            bitIndex = KEY_TABLE[i] % 8;
            index = KEY_TABLE[i] / 8;
            if (index < 17)
                KEYBOARD_Rep_Buff[index] = (0x01 << bitIndex) | KEYBOARD_Rep_Buff[index];
            else
                CONSUMER_Rep_Buff[1] = (0x01 << bitIndex) | CONSUMER_Rep_Buff[1];
        }
        else
        {
            continue;
        }
    }

    if (KNOB_CCW)
    {
        CONSUMER_Rep_Buff[1] = CONSUMER_Rep_Buff[1] | 0x01;
        // KNOB_CW = 0;
        // KNOB_CCW = 0;
    }
    else if (KNOB_CW)
    {
        CONSUMER_Rep_Buff[1] = CONSUMER_Rep_Buff[1] | 0x02;
        // KNOB_CW = 0;
        // KNOB_CCW = 0;
    }
    KNOB_CW = 0;
    KNOB_CCW = 0;
}

// Function to scan the key state
static void scan_key(nrf_timer_event_t event_type, void *p_context)
{
    nrf_gpio_pin_set(PL_Pin);

    APP_ERROR_CHECK(nrfx_spim_xfer(&scan_spi, &scan_spi_desc, NULL));
    memcpy(scan_buff, m_rx_buff, KEY_NUMBER / 8);
    nrf_gpio_pin_clear(PL_Pin);

    uint32_t a = debouncefilter(100);

    memset(&KEYBOARD_Rep_Buff[1], 0, keyboard_rep_byte - 1);
    memset(&CONSUMER_Rep_Buff[1], 0, consumer_rep_byte - 1);

    remap();
    // if Keyboard report buff has changed
    if (memcmp(&KEYBOARD_Rep_Buff_Prev[1], &KEYBOARD_Rep_Buff[1], keyboard_rep_byte - 1))
    {
        KBD_Send(&m_app_hid_kbd, KEYBOARD_Rep_Buff);
    }
    // else if consumer report buffer has changed
    else if (memcmp(&CONSUMER_Rep_Buff_Prev[1], &CONSUMER_Rep_Buff[1], consumer_rep_byte - 1))
    {
        KBD_Send(&m_app_hid_kbd, CONSUMER_Rep_Buff);
    }
    // if none of the report buffers are change
    else
    {
        app_usbd_event_queue_process();
        nrf_gpio_pin_clear(PL_Pin);
        Check_Mode();
        return;
    }

    app_usbd_event_queue_process();

    memcpy(&KEYBOARD_Rep_Buff_Prev[1], &KEYBOARD_Rep_Buff[1], keyboard_rep_byte - 1);
    memcpy(&CONSUMER_Rep_Buff_Prev[1], &CONSUMER_Rep_Buff[1], consumer_rep_byte - 1);

    Check_Mode();
}

void TXD_blink()
{
    for (;;)
    {
        nrf_gpio_pin_clear(TX_PIN_NUMBER);
        nrf_delay_ms(1000);
        nrf_gpio_pin_set(TX_PIN_NUMBER);
        nrf_delay_ms(1000);
    }
}

// Function to init Wire Mode Keyboard
void Wire_Mode()
{
    nrf_gpio_cfg_output(MOS_CTRL_PIN);
    nrf_gpio_pin_set(MOS_CTRL_PIN);
    // Pin_Cfg();
    ret_code_t ret;
    static const app_usbd_config_t usbd_config = {
        .ev_state_proc = usbd_user_ev_handler,
    };

    // 禁止后蜂鸣器会一直响，且LED状态不正常
    ret = nrf_drv_clock_init();
    APP_ERROR_CHECK(ret);

    ret = app_usbd_init(&usbd_config);
    APP_ERROR_CHECK(ret);

    app_usbd_class_inst_t const *class_inst_kbd;

    class_inst_kbd = app_usbd_hid_kbd_class_inst_get(&m_app_hid_kbd);
    ret = app_usbd_class_append(class_inst_kbd);

    APP_ERROR_CHECK(ret);

    uint32_t time_ticks;
    uint32_t err_code = NRF_SUCCESS;
    nrfx_timer_config_t timer_cfg = NRFX_TIMER_DEFAULT_CONFIG;
    timer_cfg.interrupt_priority = 6;
    err_code = nrfx_timer_init(&TIMER_KBD, &timer_cfg, scan_key);
    APP_ERROR_CHECK(err_code);
    time_ticks = nrfx_timer_us_to_ticks(&TIMER_KBD, 900);
    // Set compare, when counter value = time_ticks -> interrupt
    nrfx_timer_extended_compare(&TIMER_KBD, NRF_TIMER_CC_CHANNEL0, time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

    if (USBD_POWER_DETECTION)
    {
        ret = app_usbd_power_events_enable();
        APP_ERROR_CHECK(ret);
    }
    else
    {
        // NRF_LOG_INFO("No USB power detection enabled\r\nStarting USB now");

        app_usbd_enable();
        app_usbd_start();
    }

    for (uint32_t i = 0; i < 200000; i++)
    {
        app_usbd_event_queue_process();
    }

    nrfx_timer_enable(&TIMER_KBD);

    while (true)
    {
        ws2812_effect(RGB_LIGHT);
    }
}

/**
 * @brief Function to control the LED outputs.
 *
 * @param[in] val Desirable state of the LEDs.
 */
static void output_present(uint8_t val)
{
    if ((val & 0x02) != 0)
    {
        LED_On(LED0);
    }
    else
    {
        LED_Off(LED0);
    }

    if ((val & 0x01) != 0)
    {
        LED_On(LED1);
    }
    else
    {
        LED_Off(LED1);
    }

    if ((val & 0x04) != 0)
    {
        LED_On(LED2);
    }
    else
    {
        LED_Off(LED2);
    }
}

/**
 * @brief Function to read the button states.
 *
 * @return Returns states of buttons.
 */
void input_get(uint8_t *array)
{
    memset(array, 0, 17);
    nrf_gpio_pin_set(PL_Pin);

    APP_ERROR_CHECK(nrfx_spim_xfer(&scan_spi, &scan_spi_desc, NULL));
    memcpy(scan_buff, m_rx_buff, KEY_NUMBER / 8);
    nrf_gpio_pin_clear(PL_Pin);

    uint32_t a = debouncefilter(100);

    memset(&KEYBOARD_Rep_Buff[1], 0, keyboard_rep_byte - 1);
    memset(&CONSUMER_Rep_Buff[1], 0, consumer_rep_byte - 1);

    remap();
    // if Keyboard report buff has changed
    if (memcmp(&KEYBOARD_Rep_Buff_Prev[1], &KEYBOARD_Rep_Buff[1], keyboard_rep_byte - 1))
    {
        memcpy(array, KEYBOARD_Rep_Buff, keyboard_rep_byte);
        Sleep_Time_Out_Counter = 0; // Set sleep counter to 0
    }
    // else if consumer report buffer has changed
    else if (memcmp(&CONSUMER_Rep_Buff_Prev[1], &CONSUMER_Rep_Buff[1], consumer_rep_byte - 1))
    {
        array[0] = CONSUMER_Rep_Buff[0];
        array[1] = CONSUMER_Rep_Buff[1];
        Sleep_Time_Out_Counter = 0; // Set sleep counter to 0
    }
    // if none of the report buffers are change
    else
    {
        nrf_gpio_pin_clear(PL_Pin);
        Check_Mode();
        return;
    }

    memcpy(&KEYBOARD_Rep_Buff_Prev[1], &KEYBOARD_Rep_Buff[1], keyboard_rep_byte - 1);
    memcpy(&CONSUMER_Rep_Buff_Prev[1], &CONSUMER_Rep_Buff[1], consumer_rep_byte - 1);

    Check_Mode();
}

/**
 * @brief Initialize the BSP modules.
 */
static void ui_init(void)
{
    uint32_t err_code;

    // Set up logger
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();

    // NRF_LOG_INFO("Gazell ACK payload example. Device mode.");
    NRF_LOG_FLUSH();
}

/* Add scan buffer to fifo */
static void add_pack()
{
    nrf_gpio_pin_set(PL_Pin);

    APP_ERROR_CHECK(nrfx_spim_xfer(&scan_spi, &scan_spi_desc, NULL));
    memcpy(scan_buff, m_rx_buff, KEY_NUMBER / 8);

    uint32_t a = debouncefilter(100);

