BrianLChen/nRF52840-2.4GKeyboard/Application/main.c
    memset(&KEYBOARD_Rep_Buff[1], 0, keyboard_rep_byte - 1);
    memset(&CONSUMER_Rep_Buff[1], 0, consumer_rep_byte - 1);

    remap();
    // if Keyboard report buff has changed
    if (memcmp(&KEYBOARD_Rep_Buff_Prev[1], &KEYBOARD_Rep_Buff[1], keyboard_rep_byte - 1))
    {
        // memcpy(array, KEYBOARD_Rep_Buff, keyboard_rep_byte);
        nrf_gzll_add_packet_to_tx_fifo(PIPE_NUMBER, KEYBOARD_Rep_Buff, keyboard_rep_byte);
        Sleep_Time_Out_Counter = 0; // Set sleep counter to 0
    }
    // else if consumer report buffer has changed
    else if (memcmp(&CONSUMER_Rep_Buff_Prev[1], &CONSUMER_Rep_Buff[1], consumer_rep_byte - 1))
    {
        // array[0] = CONSUMER_Rep_Buff[0];
        // array[1] = CONSUMER_Rep_Buff[1];
        nrf_gzll_add_packet_to_tx_fifo(PIPE_NUMBER, CONSUMER_Rep_Buff, consumer_rep_byte);
        Sleep_Time_Out_Counter = 0; // Set sleep counter to 0
    }
    // if none of the report buffers are change
    else
    {

        nrf_gpio_pin_clear(PL_Pin);
        Check_Mode();
        return;
    }

    memcpy(&KEYBOARD_Rep_Buff_Prev[1], &KEYBOARD_Rep_Buff[1], keyboard_rep_byte - 1);
    memcpy(&CONSUMER_Rep_Buff_Prev[1], &CONSUMER_Rep_Buff[1], consumer_rep_byte - 1);
    nrf_gpio_pin_clear(PL_Pin);

    Check_Mode();
}

/*****************************************************************************/
/** @name Gazell callback function definitions  */
/*****************************************************************************/
/**
 * @brief TX success callback.
 *
 * @details If an ACK was received, another packet is sent.
 */
void nrf_gzll_device_tx_success(uint32_t pipe, nrf_gzll_device_tx_info_t tx_info)
{
    bool result_value = false;

    // Load data payload into the TX queue.
    input_get(m_data_payload);

    result_value = nrf_gzll_add_packet_to_tx_fifo(pipe, m_data_payload, TX_PAYLOAD_LENGTH);

    if (!result_value)
    {
        NRF_LOG_ERROR("TX fifo error ");
    }

    uint32_t m_ack_payload_length = NRF_GZLL_CONST_MAX_PAYLOAD_LENGTH;

    if (tx_info.payload_received_in_ack)
    {
        // Pop packet and write first byte of the payload to the GPIO port.
        result_value =
            nrf_gzll_fetch_packet_from_rx_fifo(pipe, m_ack_payload, &m_ack_payload_length);
        if (!result_value)
        {
            NRF_LOG_ERROR("RX fifo error ");
        }

        if (m_ack_payload_length > 0)
        {
            output_present(m_ack_payload[0]);
        }
    }
}

/**
 * @brief TX failed callback.
 *
 * @details If the transmission failed, send a new packet.
 *
 * @warning This callback does not occur by default since NRF_GZLL_DEFAULT_MAX_TX_ATTEMPTS
 * is 0 (inifinite retransmits).
 */
void nrf_gzll_device_tx_failed(uint32_t pipe, nrf_gzll_device_tx_info_t tx_info)
{
    // NRF_LOG_ERROR("Gazell transmission failed");

    // Load data into TX queue.
    input_get(m_data_payload);

    bool result_value = nrf_gzll_add_packet_to_tx_fifo(pipe, m_data_payload, TX_PAYLOAD_LENGTH);
    if (!result_value)
    {
        NRF_LOG_ERROR("TX fifo error ");
    }
}

/**
 * @brief Gazelle callback.
 * @warning Required for successful Gazell initialization.
 */
void nrf_gzll_host_rx_data_ready(uint32_t pipe, nrf_gzll_host_rx_info_t rx_info)
{
}

/**
 * @brief Gazelle callback.
 * @warning Required for successful Gazell initialization.
 */
void nrf_gzll_disabled()
{
}

// Function to init 2.4G Wireless Mode Keyboard
void Wireless_Mode()
{
    nrf_gpio_cfg_output(MOS_CTRL_PIN);
    nrf_gpio_pin_set(MOS_CTRL_PIN);
    // Set up the user interface (buttons and LEDs).
    ui_init();

    nrf_pwr_mgmt_init();

    // Initialize Gazell.
    bool result_value = nrf_gzll_init(NRF_GZLL_MODE_DEVICE);
    GAZELLE_ERROR_CODE_CHECK(result_value);
    nrf_gzll_set_timeslot_period(600);

    // set base address for pipe1
    result_value = nrf_gzll_set_base_address_1(0xbc010827);
    GAZELLE_ERROR_CODE_CHECK(result_value);
    result_value = nrf_gzll_set_address_prefix_byte(PIPE_NUMBER, 0x27);
    GAZELLE_ERROR_CODE_CHECK(result_value);

    // set frequency hopping
    nrf_gzll_set_channel_table(Channel_Table, Channel_Table_Size);
    nrf_gzll_set_timeslots_per_channel(3);
    nrf_gzll_set_timeslots_per_channel_when_device_out_of_sync(20);
    nrf_gzll_set_device_channel_selection_policy(NRF_GZLL_DEVICE_CHANNEL_SELECTION_POLICY_USE_CURRENT);
    nrf_gzll_set_sync_lifetime(45);

    // Attempt sending every packet up to MAX_TX_ATTEMPTS times.
    nrf_gzll_set_max_tx_attempts(MAX_TX_ATTEMPTS);

    // input_get(m_data_payload);

    result_value = nrf_gzll_add_packet_to_tx_fifo(PIPE_NUMBER, m_data_payload, TX_PAYLOAD_LENGTH);

    nrfx_timer_config_t timer_cfg = NRFX_TIMER_DEFAULT_CONFIG;
    timer_cfg.frequency = 9;
    timer_cfg.interrupt_priority = 7;
    nrfx_timer_init(&TIMER_SLEEP, &timer_cfg, Sleep_Counter);
    uint32_t time_ticks = nrfx_timer_ms_to_ticks(&TIMER_SLEEP, 1000);
    // Set compare, when counter value = time_ticks -> interrupt
    nrfx_timer_extended_compare(&TIMER_SLEEP, NRF_TIMER_CC_CHANNEL0, time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

    // Enable Gazell to start sending over the air.
    result_value = nrf_gzll_enable();

    nrfx_timer_enable(&TIMER_SLEEP);

    GAZELLE_ERROR_CODE_CHECK(result_value);

    while (true)
    {
        //__WFE();
        ws2812_effect(RGB_LIGHT);
    }
}

// TODO
void BLE_Mode()
{
    Check_Mode();
}
int main(void)
{
    Pin_Cfg();

    KEYBOARD_Rep_Buff[0] = 0x01;
    KEYBOARD_Rep_Buff_Prev[0] = 0x01;
    CONSUMER_Rep_Buff[0] = 0x02;
    CONSUMER_Rep_Buff_Prev[0] = 0x02;

    m_tx_buff[0] = 0x00;
    m_tx_buff[1] = 0x00;

    nrfx_spim_config_t spi_config = NRFX_SPI_DEFAULT_CONFIG;
    spi_config.ss_pin = SER_APP_SPIM0_SS_PIN;
    spi_config.miso_pin = SER_APP_SPIM0_MISO_PIN;
    spi_config.mosi_pin = NRFX_SPI_PIN_NOT_USED; /* Only Read */
    spi_config.sck_pin = SER_APP_SPIM0_SCK_PIN;
    spi_config.frequency = NRF_SPIM_FREQ_4M;
    nrf_delay_ms(100);

    APP_ERROR_CHECK(nrfx_spim_init(&scan_spi, &spi_config, NULL, NULL));

    // APP_ERROR_CHECK(nrfx_spim_xfer(&scan_spi, &scan_spi_desc, NULL));

    input_get(m_data_payload);

    ws2812_init(RGB_LIGHT);
    // memset(m_rx_buff, 0, 2);

    knob_init();

    for (;;)
    {
        if (nrf_gpio_pin_read(WIRELESS_MODE_PIN) == 0)
        {
            Mode = 1;
            break;
        }
        else if (nrf_gpio_pin_read(BLE_MODE_PIN) == 0)
        {
            Mode = 2;
            break;
        }
        else if (nrf_gpio_pin_read(WIRE_MODE_PIN) == 0)
        {
            Mode = 3;
            break;
        }
        else
        {
            continue;
        }
    }

    // uint32_t mode = nrf_gpio_pin_read(Mode_Pin);

    if (Mode == 3)
        Wire_Mode();
    else if (Mode == 1)
        Wireless_Mode();
    else if (Mode == 2)
        BLE_Mode();
    else // error
        NVIC_SystemReset();
}